In [1]:
from dataset import MysqlIO
import pandas as pd
import pandas_profiling as pp
from IPython.display import display
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
import numpy as np

In [2]:
db = MysqlIO(host='relational.fit.cvut.cz', 
            database='financial', 
            user='guest', 
            password='relational')

Connected to MySQL Server version 5.5.5-10.3.15-MariaDB-log
Your're connected to database: financial

In [3]:
db.execute('SHOW TABLES')

[('account',),
 ('card',),
 ('client',),
 ('disp',),
 ('district',),
 ('loan',),
 ('order',),
 ('trans',)]

In [4]:
loan_df = db.execute_to_df('SELECT * FROM loan')
order_df = db.execute_to_df('SELECT * FROM `order`')
trans_df = db.execute_to_df('SELECT * FROM trans')
disp_df = db.execute_to_df('SELECT * FROM disp')
account_df = db.execute_to_df('SELECT * FROM account')
client_df = db.execute_to_df('SELECT * FROM client')
card_df = db.execute_to_df('SELECT * FROM card')
district_df = db.execute_to_df('SELECT * FROM district')

In [7]:
def summary_df(df, table_name=''):
    print(table_name)
    print(df.shape)
    display(df.head())
    print('missing value')
    display(df.isnull().sum())

In [6]:
summary_df(loan_df, "loan")
summary_df(order_df, "order")
summary_df(trans_df, "trans")
summary_df(disp_df, "disp")
summary_df(account_df, "account")
summary_df(client_df, "client")
summary_df(card_df, "card")
summary_df(district_df, "district")

loan
(682, 7)

   loan_id  account_id        date  amount  duration payments status
0     4959           2  1994-01-05   80952        24  3373.00      A
1     4961          19  1996-04-29   30276        12  2523.00      B
2     4962          25  1997-12-08   30276        12  2523.00      A
3     4967          37  1998-10-14  318480        60  5308.00      D
4     4968          38  1998-04-19  110736        48  2307.00      C

missing value

loan_id       0
account_id    0
date          0
amount        0
duration      0
payments      0
status        0
dtype: int64

order
(6471, 6)

   order_id  account_id bank_to  account_to  amount k_symbol
0     29401           1      YZ    87144583  2452.0     SIPO
1     29402           2      ST    89597016  3372.7     UVER
2     29403           2      QR    13943797  7266.0     SIPO
3     29404           3      WX    83084338  1135.0     SIPO
4     29405           3      CD    24485939   327.0

missing value

order_id      0
account_id    0
bank_to       0
account_to    0
amount        0
k_symbol      0
dtype: int64

trans
(1056320, 10)

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,1,1,1995-03-24,PRIJEM,VKLAD,1000,1000,None,None,NaN
1,5,1,1995-04-13,PRIJEM,PREVOD Z UCTU,3679,4679,None,AB,41403269.0
2,6,1,1995-05-13,PRIJEM,PREVOD Z UCTU,3679,20977,None,AB,41403269.0
3,7,1,1995-06-13,PRIJEM,PREVOD Z UCTU,3679,26835,None,AB,41403269.0
4,8,1,1995-07-13,PRIJEM,PREVOD Z UCTU,3679,30415,None,AB,41403269.0

missing value

trans_id           0
account_id         0
date               0
type               0
operation     183114
amount             0
balance            0
k_symbol      481881
bank          782812
account       760931
dtype: int64

disp
(5369, 4)

   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT

missing value

disp_id       0
client_id     0
account_id    0
type          0
dtype: int64

account
(4500, 4)

   account_id  district_id         frequency        date
0           1           18  POPLATEK MESICNE  1995-03-24
1           2            1  POPLATEK MESICNE  1993-02-26
2           3            5  POPLATEK MESICNE  1997-07-07
3           4           12  POPLATEK MESICNE  1996-02-21
4           5           15  POPLATEK MESICNE  1997-05-30

missing value

account_id     0
district_id    0
frequency      0
date           0
dtype: int64

client
(5369, 4)

   client_id gender  birth_date  district_id
0          1      F  1970-12-13           18
1          2      M  1945-02-04            1
2          3      F  1940-10-09            1
3          4      M  1956-12-01            5
4          5      F  1960-07-03            5

missing value

client_id      0
gender         0
birth_date     0
district_id    0
dtype: int64

card
(892, 4)

   card_id  disp_id     type      issued
0        1        9     gold  1998-10-16
1        2       19  classic  1998-03-13
2        3       41     gold  1995-09-03
3        4       42  classic  1998-11-26
4        5       51   junior  1995-04-24

missing value

card_id    0
disp_id    0
type       0
issued     0
dtype: int64

district
(77, 16)

,district_id,A2,A3,A4,A5,A6,A7,A8,A9,A10,A11,A12,A13,A14,A15,A16
0,1,Hl.m. Praha,Prague,1204953,0,0,0,1,1,100.0,12541,0.2,0.43,167,85677.0,99107
1,2,Benesov,central Bohemia,88884,80,26,6,2,5,46.7,8507,1.6,1.85,132,2159.0,2674
2,3,Beroun,central Bohemia,75232,55,26,4,1,5,41.7,8980,1.9,2.21,111,2824.0,2813
3,4,Kladno,central Bohemia,149893,63,29,6,2,6,67.4,9753,4.6,5.05,109,5244.0,5892
4,5,Kolin,central Bohemia,95616,65,30,4,1,6,51.4,9307,3.8,4.43,118,2616.0,3040

missing value

district_id    0
A2             0
A3             0
A4             0
A5             0
A6             0
A7             0
A8             0
A9             0
A10            0
A11            0
A12            1
A13            0
A14            0
A15            1
A16            0
dtype: int64

1 client can have multiple accounts.
Also, 1 account can have multiple clients (owner, desponent).

In [8]:
print(loan_df['account_id'].is_unique)
print(account_df['account_id'].is_unique)
print(disp_df['account_id'].is_unique)

True
True
False

# Data manipulation

In [21]:
def add_prefix_to_colnames(df, prefix, fixed_col_name='account_id'):
    df = df.add_prefix(prefix)
    df = df.rename(index=str, columns={prefix+fixed_col_name : fixed_col_name})
    return df

def percentile(x, n):
    return x.quantile(n)

def onehot(df, col_name, prefix):
    return df.join(pd.get_dummies(df[col_name], prefix=prefix))

def summary_group_cate_data(main_df, add_df, col_names=list, how='left', on=['account_id'], validate='one_to_many', by="account_id"):
    t = pd.merge(main_df, add_df, how=how, on=on, validate=validate)
    t = t.groupby(by=by, as_index=False)[col_names].sum()
    return t

In [10]:
loan_df_ = add_prefix_to_colnames(loan_df, prefix='loan_')
print(loan_df_.shape)
loan_df_.head()

(682, 7)

,loan_loan_id,account_id,loan_date,loan_amount,loan_duration,loan_payments,loan_status
0,4959,2,1994-01-05,80952,24,3373.00,A
1,4961,19,1996-04-29,30276,12,2523.00,B
2,4962,25,1997-12-08,30276,12,2523.00,A
3,4967,37,1998-10-14,318480,60,5308.00,D
4,4968,38,1998-04-19,110736,48,2307.00,C

In [11]:
account_df_ = add_prefix_to_colnames(account_df, prefix='acc_')
print(account_df_.shape)
account_df_.head()

(4500, 4)

   account_id  acc_district_id     acc_frequency    acc_date
0           1               18  POPLATEK MESICNE  1995-03-24
1           2                1  POPLATEK MESICNE  1993-02-26
2           3                5  POPLATEK MESICNE  1997-07-07
3           4               12  POPLATEK MESICNE  1996-02-21
4           5               15  POPLATEK MESICNE  1997-05-30

In [12]:
df = pd.merge(loan_df_, account_df_, how='left', on=['account_id'])
print(df.shape)
df.head()

(682, 10)

,loan_loan_id,account_id,loan_date,loan_amount,loan_duration,loan_payments,loan_status,acc_district_id,acc_frequency,acc_date
0,4959,2,1994-01-05,80952,24,3373.00,A,1,POPLATEK MESICNE,1993-02-26
1,4961,19,1996-04-29,30276,12,2523.00,B,21,POPLATEK MESICNE,1995-04-07
2,4962,25,1997-12-08,30276,12,2523.00,A,68,POPLATEK MESICNE,1996-07-28
3,4967,37,1998-10-14,318480,60,5308.00,D,20,POPLATEK MESICNE,1997-08-18
4,4968,38,1998-04-19,110736,48,2307.00,C,19,POPLATEK TYDNE,1997-08-08

## order manipulation

due to 1 account can have more order. So, we need to manipulate order values 

such as 

amount -> min, max, sum, mean, count

k_symbol -> onehot -> sum

In [14]:
order_df.head()

   order_id  account_id bank_to  account_to  amount k_symbol
0     29401           1      YZ    87144583  2452.0     SIPO
1     29402           2      ST    89597016  3372.7     UVER
2     29403           2      QR    13943797  7266.0     SIPO
3     29404           3      WX    83084338  1135.0     SIPO
4     29405           3      CD    24485939   327.0

order_df there are "spacing". so, we add NaN.

In [37]:
order_df['k_symbol'].value_counts()

SIPO        3502
UVER         717
POJISTNE     532
LEASING      341
Name: k_symbol, dtype: int64

In [38]:
order_df = order_df.replace("", np.nan)
order_df['k_symbol'].value_counts()

SIPO        3502
UVER         717
POJISTNE     532
LEASING      341
Name: k_symbol, dtype: int64

In [39]:
order_df.loc[order_df['k_symbol']=="POJISTNE", 'k_symbol'] = 'insurrance'
order_df.loc[order_df['k_symbol']=="SIPO", 'k_symbol'] = 'household'
order_df.loc[order_df['k_symbol']=="LEASING", 'k_symbol'] = 'leasing'
order_df.loc[order_df['k_symbol']=="UVER", 'k_symbol'] = 'loan'

print(order_df.shape)
order_df.head()

(6471, 6)

   order_id  account_id bank_to  account_to  amount   k_symbol
0     29401           1      YZ    87144583  2452.0  household
1     29402           2      ST    89597016  3372.7       loan
2     29403           2      QR    13943797  7266.0  household
3     29404           3      WX    83084338  1135.0  household
4     29405           3      CD    24485939   327.0        NaN

k_symbol onehot encoding

In [40]:
order_df_ = onehot(order_df, col_name='k_symbol', prefix='k_symbol_')
order_df_.head()

,order_id,account_id,bank_to,account_to,amount,k_symbol,k_symbol__household,k_symbol__insurrance,k_symbol__leasing,k_symbol__loan
0,29401,1,YZ,87144583,2452.0,household,1,0,0,0
1,29402,2,ST,89597016,3372.7,loan,0,0,0,1
2,29403,2,QR,13943797,7266.0,household,1,0,0,0
3,29404,3,WX,83084338,1135.0,household,1,0,0,0
4,29405,3,CD,24485939,327.0,NaN,0,0,0,0

Drop bank_to, account_to, k_symbol

In [41]:
order_df_ = order_df_.drop(['order_id', 'bank_to', 'account_to', 'k_symbol'], axis=1)
order_df_.head()

,account_id,amount,k_symbol__household,k_symbol__insurrance,k_symbol__leasing,k_symbol__loan
0,1,2452.0,1,0,0,0
1,2,3372.7,0,0,0,1
2,2,7266.0,1,0,0,0
3,3,1135.0,1,0,0,0
4,3,327.0,0,0,0,0

In [ ]:
k_symbol = ['k_symbol__household', 'k_symbol__insurrance', 'k_symbol__leasing', 'k_symbol__loan']
order_ksymbol = summary_group_cate_data(df, order_df_, col_names=k_symbol)
order_ksymbol

,account_id,k_symbol__household,k_symbol__insurrance,k_symbol__leasing,k_symbol__loan
0,2,1,0,0,1
1,19,0,0,0,1
2,25,1,1,0,1
3,37,1,1,0,1
4,38,1,1,0,1
...,...,...,...,...,...
677,11327,1,0,0,1
678,11328,0,0,0,1
679,11349,1,0,0,1
680,11359,1,0,0,1
681,11362,1,1,0,1

In [ ]:
def summary_group_num_data(main_df, add_df, col_name=str, how='left', on=['account_id'], validate='one_to_many', by="account_id"):
    t = pd.merge(main_df, add_df, how=how, on=on, validate=validate)
    tt = t.groupby(by=by)[col_name].agg([min, max, sum]).reset_index()

    tt['mean'] = t.groupby(by="account_id")[col_name].mean().reset_index(drop=True)
    tt['count'] = t.groupby(by="account_id")[col_name].count().reset_index(drop=True)

    return tt

In [ ]:
order_amount_df = summary_group_num_data(df, order_df_, col_name='amount')

order_amount_df = add_prefix_to_colnames(order_amount_df, prefix='amount_')
order_amount_df

     account_id amount_min amount_max amount_sum  amount_mean  amount_count
0             2     3372.7     7266.0    10638.7  5319.350000             2
1            19     2523.2     2523.2     2523.2  2523.200000             1
2            25      164.0     6817.0    10614.2  2653.550000             4
3            37       97.0     5307.5    10305.5  2576.375000             4
4            38      228.0     6901.0     9666.8  2416.700000             4
..          ...        ...        ...        ...          ...           ...
677       11327     1632.0     3693.0     5325.0  2662.500000             2
678       11328     4674.0     4674.0     4674.0  4674.000000             1
679       11349     6998.0    10886.0    17884.0  8942.000000             2
680       11359      254.0     4518.0     9274.3  3091.433333             3
681       11362       56.0     5392.0    10687.0  2137.400000             5

[682 rows x 6 columns]

In [ ]:
order_amount_df = add_prefix_to_colnames(order_amount_df, prefix='order_')
order_ksymbol = add_prefix_to_colnames(order_ksymbol, prefix='order_')

In [ ]:
df = pd.merge(df, order_amount_df, how='left', on=['account_id'])
df = pd.merge(df, order_ksymbol, how='left', on=['account_id'])
df

,loan_loan_id,account_id,loan_date,loan_amount,loan_duration,loan_payments,loan_status,acc_district_id,acc_frequency,acc_date,order_amount_min,order_amount_max,order_amount_sum,order_amount_mean,order_amount_count,order_k_symbol__household,order_k_symbol__insurrance,order_k_symbol__leasing,order_k_symbol__loan
0,4959,2,1994-01-05,80952,24,3373.00,A,1,POPLATEK MESICNE,1993-02-26,3372.7,7266.0,10638.7,5319.350000,2,1,0,0,1
1,4961,19,1996-04-29,30276,12,2523.00,B,21,POPLATEK MESICNE,1995-04-07,2523.2,2523.2,2523.2,2523.200000,1,0,0,0,1
2,4962,25,1997-12-08,30276,12,2523.00,A,68,POPLATEK MESICNE,1996-07-28,164.0,6817.0,10614.2,2653.550000,4,1,1,0,1
3,4967,37,1998-10-14,318480,60,5308.00,D,20,POPLATEK MESICNE,1997-08-18,97.0,5307.5,10305.5,2576.375000,4,1,1,0,1
4,4968,38,1998-04-19,110736,48,2307.00,C,19,POPLATEK TYDNE,1997-08-08,228.0,6901.0,9666.8,2416.700000,4,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
677,7294,11327,1998-09-27,39168,24,1632.00,C,7,POPLATEK MESICNE,1997-10-15,1632.0,3693.0,5325.0,2662.500000,2,1,0,0,1
678,7295,11328,1998-07-18,280440,60,4674.00,C,54,POPLATEK MESICNE,1996-11-05,4674.0,4674.0,4674.0,4674.000000,1,0,0,0,1
679,7304,11349,1995-10-29,419880,60,6998.00,C,1,POPLATEK TYDNE,1995-05-26,6998.0,10886.0,17884.0,8942.000000,2,1,0,0,1
680,7305,11359,1996-08-06,54024,12,4502.00,A,61,POPLATEK MESICNE,1994-10-01,254.0,4518.0,9274.3,3091.433333,3,1,0,0,1
681,7308,11362,1996-12-27,129408,24,5392.00,A,67,POPLATEK MESICNE,1995-10-14,56.0,5392.0,10687.0,2137.400000,5,1,1,0,1

## Transaction

In [ ]:
summary_df(trans_df)

(1056320, 10)

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,1,1,1995-03-24,PRIJEM,VKLAD,1000,1000,None,None,NaN
1,5,1,1995-04-13,PRIJEM,PREVOD Z UCTU,3679,4679,None,AB,41403269.0
2,6,1,1995-05-13,PRIJEM,PREVOD Z UCTU,3679,20977,None,AB,41403269.0
3,7,1,1995-06-13,PRIJEM,PREVOD Z UCTU,3679,26835,None,AB,41403269.0
4,8,1,1995-07-13,PRIJEM,PREVOD Z UCTU,3679,30415,None,AB,41403269.0

missing value

trans_id           0
account_id         0
date               0
type               0
operation     183114
amount             0
balance            0
k_symbol      481881
bank          782812
account       760931
dtype: int64

replace None (null values), spacing with NaN

In [138]:
# check values not in list (show spacing)
trans_df.loc[~trans_df['k_symbol'].isin(["POJISTNE", "SLUZBY", "UROK", "SANKC. UROK", "SIPO", "DUCHOD", "UVER", np.nan]) , :]

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,1,1,1995-03-24,PRIJEM,VKLAD,1000,1000,None,None,NaN
1,5,1,1995-04-13,PRIJEM,PREVOD Z UCTU,3679,4679,None,AB,41403269.0
2,6,1,1995-05-13,PRIJEM,PREVOD Z UCTU,3679,20977,None,AB,41403269.0
3,7,1,1995-06-13,PRIJEM,PREVOD Z UCTU,3679,26835,None,AB,41403269.0
4,8,1,1995-07-13,PRIJEM,PREVOD Z UCTU,3679,30415,None,AB,41403269.0
...,...,...,...,...,...,...,...,...,...,...
871624,3431280,11382,1998-08-04,VYDAJ,VYBER,1400,12979,None,None,NaN
871625,3431281,11382,1998-09-03,VYDAJ,VYBER,12900,23954,None,None,NaN
871626,3431282,11382,1998-10-03,VYDAJ,VYBER,23000,32145,None,None,NaN
871627,3431283,11382,1998-11-02,VYDAJ,VYBER,18900,35478,None,None,NaN
871628,3431284,11382,1998-12-02,VYDAJ,VYBER,25600,41114,None,None,NaN

In [139]:
# fill spacing with nan
trans_df = trans_df.replace(' ', np.nan)
# check
trans_df.loc[~trans_df['k_symbol'].isin(["POJISTNE", "SLUZBY", "UROK", "SANKC. UROK", "SIPO", "DUCHOD", "UVER", np.nan]) , :]

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,1,1,1995-03-24,PRIJEM,VKLAD,1000,1000,None,None,NaN
1,5,1,1995-04-13,PRIJEM,PREVOD Z UCTU,3679,4679,None,AB,41403269.0
2,6,1,1995-05-13,PRIJEM,PREVOD Z UCTU,3679,20977,None,AB,41403269.0
3,7,1,1995-06-13,PRIJEM,PREVOD Z UCTU,3679,26835,None,AB,41403269.0
4,8,1,1995-07-13,PRIJEM,PREVOD Z UCTU,3679,30415,None,AB,41403269.0
...,...,...,...,...,...,...,...,...,...,...
871624,3431280,11382,1998-08-04,VYDAJ,VYBER,1400,12979,None,None,NaN
871625,3431281,11382,1998-09-03,VYDAJ,VYBER,12900,23954,None,None,NaN
871626,3431282,11382,1998-10-03,VYDAJ,VYBER,23000,32145,None,None,NaN
871627,3431283,11382,1998-11-02,VYDAJ,VYBER,18900,35478,None,None,NaN
871628,3431284,11382,1998-12-02,VYDAJ,VYBER,25600,41114,None,None,NaN

In [140]:
# fill None with nan
trans_df = trans_df.fillna(value=np.nan)
trans_df

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,1,1,1995-03-24,PRIJEM,VKLAD,1000,1000,NaN,NaN,NaN
1,5,1,1995-04-13,PRIJEM,PREVOD Z UCTU,3679,4679,NaN,AB,41403269.0
2,6,1,1995-05-13,PRIJEM,PREVOD Z UCTU,3679,20977,NaN,AB,41403269.0
3,7,1,1995-06-13,PRIJEM,PREVOD Z UCTU,3679,26835,NaN,AB,41403269.0
4,8,1,1995-07-13,PRIJEM,PREVOD Z UCTU,3679,30415,NaN,AB,41403269.0
...,...,...,...,...,...,...,...,...,...,...
1056315,3682983,10451,1998-08-31,PRIJEM,NaN,62,17300,UROK,NaN,NaN
1056316,3682984,10451,1998-09-30,PRIJEM,NaN,49,13442,UROK,NaN,NaN
1056317,3682985,10451,1998-10-31,PRIJEM,NaN,34,10118,UROK,NaN,NaN
1056318,3682986,10451,1998-11-30,PRIJEM,NaN,26,8398,UROK,NaN,NaN
1056319,3682987,10451,1998-12-31,PRIJEM,NaN,42,13695,UROK,NaN,NaN

type have class "PRIJEM", "VYDAJ". Also "VYBER" (not show in https://web.archive.org/web/20180506035658/http://lisp.vse.cz/pkdd99/Challenge/berka.htm)

include "VYBER" to "VYDAJ" as withdrawal.

In [ ]:
trans_df['type'].value_counts()

VYDAJ     634571
PRIJEM    405083
VYBER      16666
Name: type, dtype: int64

In [ ]:
trans_df['operation'].value_counts()

VYBER             434918
PREVOD NA UCET    208283
VKLAD             156743
PREVOD Z UCTU      65226
VYBER KARTOU        8036
Name: operation, dtype: int64

In [ ]:
trans_df['k_symbol'].value_counts()

UROK           183114
SLUZBY         155832
SIPO           118065
DUCHOD          30338
POJISTNE        18500
UVER            13580
SANKC. UROK      1577
Name: k_symbol, dtype: int64

In [154]:
trans_df_ = trans_df.copy()
# type
trans_df_.loc[trans_df['type']=="PRIJEM", 'type'] = 'credit'
trans_df_.loc[trans_df['type']=="VYDAJ", 'type'] = 'withdrawal'
trans_df_.loc[trans_df['type']=="VYBER", 'type'] = 'withdrawal'

# operation
trans_df_.loc[trans_df['operation']=="VYBER KARTOU", 'operation'] = 'credit_card_withdrawal'
trans_df_.loc[trans_df['operation']=="VKLAD", 'operation'] = 'credit_in_cash'
trans_df_.loc[trans_df['operation']=="PREVOD Z UCTU", 'operation'] = 'collection_from_anotherbank'
trans_df_.loc[trans_df['operation']=="VYBER", 'operation'] = 'withdrawal_in_cash'
trans_df_.loc[trans_df['operation']=="PREVOD NA UCET", 'operation'] = 'remittance_to_anotherbank'

# k_symbol
trans_df_.loc[trans_df['k_symbol']=="POJISTNE", 'k_symbol'] = 'insurrance'
trans_df_.loc[trans_df['k_symbol']=="SLUZBY", 'k_symbol'] = 'payment_for_statement'
trans_df_.loc[trans_df['k_symbol']=="UROK", 'k_symbol'] = 'interest_credited'
trans_df_.loc[trans_df['k_symbol']=="SANKC. UROK", 'k_symbol'] = 'sanction_interest_neg_bal'
trans_df_.loc[trans_df['k_symbol']=="SIPO", 'k_symbol'] = 'household'
trans_df_.loc[trans_df['k_symbol']=="DUCHOD", 'k_symbol'] = 'old-age_pension'
trans_df_.loc[trans_df['k_symbol']=="UVER", 'k_symbol'] = 'loan'

# # onehot
trans_df_ = trans_df_.join(pd.get_dummies(trans_df_['type'], prefix='type'))
trans_df_ = trans_df_.join(pd.get_dummies(trans_df_['operation'], prefix='operation'))
trans_df_ = trans_df_.join(pd.get_dummies(trans_df_['k_symbol'], prefix='k_symbol'))

trans_df_.head()

,trans_id,account_id,date,type,operation,amount,balance,k_symbol,bank,account
0,1,1,1995-03-24,credit,credit_in_cash,1000,1000,NaN,NaN,NaN
1,5,1,1995-04-13,credit,collection_from_anotherbank,3679,4679,NaN,AB,41403269.0
2,6,1,1995-05-13,credit,collection_from_anotherbank,3679,20977,NaN,AB,41403269.0
3,7,1,1995-06-13,credit,collection_from_anotherbank,3679,26835,NaN,AB,41403269.0
4,8,1,1995-07-13,credit,collection_from_anotherbank,3679,30415,NaN,AB,41403269.0

In [157]:
trans_df_[trans_df_['type'] == 'credit']['operation'].value_counts()

credit_in_cash                 156743
collection_from_anotherbank     65226
Name: operation, dtype: int64

In [ ]:
trans_df_.columns

Index(['trans_id', 'account_id', 'date', 'type', 'operation', 'amount',
       'balance', 'k_symbol', 'bank', 'account', 'type_credit',
       'type_withdrawal', 'operation_collection_from_anotherbank',
       'operation_credit_card_withdrawal', 'operation_credit_in_cash',
       'operation_remittance_to_anotherbank', 'operation_withdrawal_in_cash',
       'k_symbol_household', 'k_symbol_insurrance',
       'k_symbol_interest_credited', 'k_symbol_loan',
       'k_symbol_old-age_pension', 'k_symbol_payment_for_statement',
       'k_symbol_sanction_interest_neg_bal'],
      dtype='object')

In [153]:
trans_df_drop = trans_df_.drop(['trans_id', 'type', 'operation', 'k_symbol', 'bank', 'account'], axis=1)
trans_df_drop.head()

,account_id,date,amount,balance,type_credit,type_withdrawal,operation_collection_from_anotherbank,operation_credit_card_withdrawal,operation_credit_in_cash,operation_remittance_to_anotherbank,operation_withdrawal_in_cash,k_symbol_household,k_symbol_insurrance,k_symbol_interest_credited,k_symbol_loan,k_symbol_old-age_pension,k_symbol_payment_for_statement,k_symbol_sanction_interest_neg_bal
0,1,1995-03-24,1000,1000,1,0,0,0,1,0,0,0,0,0,0,0,0,0
1,1,1995-04-13,3679,4679,1,0,1,0,0,0,0,0,0,0,0,0,0,0
2,1,1995-05-13,3679,20977,1,0,1,0,0,0,0,0,0,0,0,0,0,0
3,1,1995-06-13,3679,26835,1,0,1,0,0,0,0,0,0,0,0,0,0,0
4,1,1995-07-13,3679,30415,1,0,1,0,0,0,0,0,0,0,0,0,0,0

date data -> 

find max, min date in each account_id and find duration. บอกระยะเวลาที่ใช้บัตรทำ transaction ตั้งแต่แรกยันล่าสุด

In [86]:
trans_df_drop['date'] = pd.to_datetime(trans_df_drop['date'], format='%Y-%m-%d')
trans_date = trans_df_drop.groupby(by='account_id').agg([min, max])['date'].reset_index()

trans_date['duration'] = trans_date['max'] - trans_date['min']
trans_date = add_prefix_to_colnames(trans_date, prefix='date_')

trans_date.head()

   account_id   date_min   date_max date_duration
0           1 1995-03-24 1998-12-31     1378 days
1           2 1993-02-26 1998-12-31     2134 days
2           3 1997-07-07 1998-12-31      542 days
3           4 1996-02-21 1998-12-31     1044 days
4           5 1997-05-30 1998-12-31      580 days

Numerical data 

amount, balance -> min, max, sum, mean, count

In [ ]:
trans_df_ = trans_df_drop.copy()
trans_df_.head()

,account_id,date,amount,balance,type_credit,type_withdrawal,operation_collection_from_anotherbank,operation_credit_card_withdrawal,operation_credit_in_cash,operation_remittance_to_anotherbank,operation_withdrawal_in_cash,k_symbol_household,k_symbol_insurrance,k_symbol_interest_credited,k_symbol_loan,k_symbol_old-age_pension,k_symbol_payment_for_statement,k_symbol_sanction_interest_neg_bal
0,1,1995-03-24,1000,1000,1,0,0,0,1,0,0,0,0,0,0,0,0,0
1,1,1995-04-13,3679,4679,1,0,1,0,0,0,0,0,0,0,0,0,0,0
2,1,1995-05-13,3679,20977,1,0,1,0,0,0,0,0,0,0,0,0,0,0
3,1,1995-06-13,3679,26835,1,0,1,0,0,0,0,0,0,0,0,0,0,0
4,1,1995-07-13,3679,30415,1,0,1,0,0,0,0,0,0,0,0,0,0,0

In [74]:
trans_amount_df = summary_group_num_data(df, trans_df_, 'amount')
trans_amount_df = add_prefix_to_colnames(trans_amount_df, prefix='amount_')

trans_balance_df = summary_group_num_data(df, trans_df_, 'balance')
trans_balance_df = add_prefix_to_colnames(trans_balance_df, prefix='balance_')

trans_numm_data_df = pd.merge(trans_amount_df, trans_balance_df, on='account_id')

print(trans_numm_data_df.shape)
trans_numm_data_df.head()

(682, 11)

,account_id,amount_min,amount_max,amount_sum,amount_mean,amount_count,balance_min,balance_max,balance_sum,balance_mean,balance_count
0,2,14,42000,3151514,6593.125523,478,1100,69302,17466493,36540.780335,478
1,19,1,22708,1575532,5199.775578,303,-10605,58158,4924680,16253.069307,303
2,25,15,63300,2958556,10797.649635,274,900,134210,15420511,56279.237226,274
3,37,0,49437,948159,7293.530769,130,-1011,104762,4881173,37547.484615,130
4,38,30,20762,571952,4399.630769,130,13841,55991,4480110,34462.384615,130

Cateforical data

type, operation, k_symbol -> onehot -> sum

In [ ]:
trans_df_.head()

,account_id,date,amount,balance,type_credit,type_withdrawal,operation_collection_from_anotherbank,operation_credit_card_withdrawal,operation_credit_in_cash,operation_remittance_to_anotherbank,operation_withdrawal_in_cash,k_symbol_household,k_symbol_insurrance,k_symbol_interest_credited,k_symbol_loan,k_symbol_old-age_pension,k_symbol_payment_for_statement,k_symbol_sanction_interest_neg_bal
0,1,1995-03-24,1000,1000,1,0,0,0,1,0,0,0,0,0,0,0,0,0
1,1,1995-04-13,3679,4679,1,0,1,0,0,0,0,0,0,0,0,0,0,0
2,1,1995-05-13,3679,20977,1,0,1,0,0,0,0,0,0,0,0,0,0,0
3,1,1995-06-13,3679,26835,1,0,1,0,0,0,0,0,0,0,0,0,0,0
4,1,1995-07-13,3679,30415,1,0,1,0,0,0,0,0,0,0,0,0,0,0

In [ ]:
cate_data_names = trans_df_.columns.to_list()[4:]
print(len(cate_data_names))
cate_data_names

14

['type_credit',
 'type_withdrawal',
 'operation_collection_from_anotherbank',
 'operation_credit_card_withdrawal',
 'operation_credit_in_cash',
 'operation_remittance_to_anotherbank',
 'operation_withdrawal_in_cash',
 'k_symbol_household',
 'k_symbol_insurrance',
 'k_symbol_interest_credited',
 'k_symbol_loan',
 'k_symbol_old-age_pension',
 'k_symbol_payment_for_statement',
 'k_symbol_sanction_interest_neg_bal']

In [71]:
trans_cate_data_df = summary_group_cate_data(df, trans_df_, col_names=cate_data_names)
print(trans_cate_data_df.shape)
trans_cate_data_df.head()

(682, 15)

,account_id,type_credit,type_withdrawal,operation_collection_from_anotherbank,operation_credit_card_withdrawal,operation_credit_in_cash,operation_remittance_to_anotherbank,operation_withdrawal_in_cash,k_symbol_household,k_symbol_insurrance,k_symbol_interest_credited,k_symbol_loan,k_symbol_old-age_pension,k_symbol_payment_for_statement,k_symbol_sanction_interest_neg_bal
0,2,152.0,326.0,70.0,0.0,12.0,89.0,237.0,65.0,0.0,70.0,24.0,0.0,65.0,0.0
1,19,152.0,151.0,45.0,0.0,17.0,8.0,143.0,32.0,0.0,90.0,8.0,0.0,40.0,8.0
2,25,82.0,192.0,0.0,0.0,54.0,93.0,99.0,27.0,27.0,28.0,12.0,0.0,26.0,0.0
3,37,36.0,94.0,0.0,0.0,19.0,43.0,51.0,14.0,14.0,17.0,1.0,0.0,13.0,1.0
4,38,48.0,82.0,17.0,0.0,14.0,45.0,37.0,12.0,12.0,17.0,8.0,0.0,12.0,0.0

In [81]:
trans_date

     account_id   date_min   date_max date_duration
0             1 1995-03-24 1998-12-31     1378 days
1             2 1993-02-26 1998-12-31     2134 days
2             3 1997-07-07 1998-12-31      542 days
3             4 1996-02-21 1998-12-31     1044 days
4             5 1997-05-30 1998-12-31      580 days
...         ...        ...        ...           ...
4495      11333 1994-05-26 1998-12-31     1680 days
4496      11349 1995-05-26 1998-12-31     1315 days
4497      11359 1994-10-01 1998-12-31     1552 days
4498      11362 1995-10-14 1998-12-31     1174 days
4499      11382 1995-08-20 1998-12-31     1229 days

[4500 rows x 4 columns]

In [ ]:
t = pd.merge(main_df, add_df, how=how, on=on, validate=validate)
    tt = t.groupby(by=by)[col_name].agg([min, max, sum]).reset_index()

In [91]:
trans_df_final = pd.merge(trans_date, trans_numm_data_df, how='right', on=['account_id'], validate='one_to_many')
trans_df_final = pd.merge(trans_df_final, trans_cate_data_df, how='left', on=['account_id'])

trans_df_final

,account_id,date_min,date_max,date_duration,amount_min,amount_max,amount_sum,amount_mean,amount_count,balance_min,...,operation_credit_in_cash,operation_remittance_to_anotherbank,operation_withdrawal_in_cash,k_symbol_household,k_symbol_insurrance,k_symbol_interest_credited,k_symbol_loan,k_symbol_old-age_pension,k_symbol_payment_for_statement,k_symbol_sanction_interest_neg_bal
0,2,1993-02-26,1998-12-31,2134 days,14,42000,3151514,6593.125523,478,1100,...,12.0,89.0,237.0,65.0,0.0,70.0,24.0,0.0,65.0,0.0
1,19,1995-04-07,1998-12-31,1364 days,1,22708,1575532,5199.775578,303,-10605,...,17.0,8.0,143.0,32.0,0.0,90.0,8.0,0.0,40.0,8.0
2,25,1996-07-28,1998-12-31,886 days,15,63300,2958556,10797.649635,274,900,...,54.0,93.0,99.0,27.0,27.0,28.0,12.0,0.0,26.0,0.0
3,37,1997-08-18,1998-12-31,500 days,0,49437,948159,7293.530769,130,-1011,...,19.0,43.0,51.0,14.0,14.0,17.0,1.0,0.0,13.0,1.0
4,38,1997-08-08,1998-12-31,510 days,30,20762,571952,4399.630769,130,13841,...,14.0,45.0,37.0,12.0,12.0,17.0,8.0,0.0,12.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
677,11327,1997-10-15,1998-12-31,442 days,15,30462,559884,7465.120000,75,300,...,16.0,12.0,33.0,9.0,0.0,14.0,3.0,0.0,9.0,0.0
678,11328,1996-11-05,1998-12-31,786 days,15,61000,1326829,9087.869863,146,1000,...,38.0,5.0,78.0,0.0,0.0,25.0,5.0,0.0,20.0,0.0
679,11349,1995-05-26,1998-12-31,1315 days,30,64800,3957378,13017.690789,304,200,...,5.0,77.0,136.0,39.0,0.0,43.0,38.0,0.0,38.0,0.0
680,11359,1994-10-01,1998-12-31,1552 days,15,40521,2948097,7799.198413,378,1000,...,2.0,104.0,148.0,46.0,0.0,51.0,12.0,0.0,46.0,0.0
681,11362,1995-10-14,1998-12-31,1174 days,15,24212,1330026,3866.354651,344,1000,...,43.0,160.0,103.0,34.0,34.0,38.0,24.0,0.0,33.0,0.0

In [92]:
trans_df_final_ = add_prefix_to_colnames(trans_df_final, prefix='trans_')
trans_df_final_

,account_id,trans_date_min,trans_date_max,trans_date_duration,trans_amount_min,trans_amount_max,trans_amount_sum,trans_amount_mean,trans_amount_count,trans_balance_min,...,trans_operation_credit_in_cash,trans_operation_remittance_to_anotherbank,trans_operation_withdrawal_in_cash,trans_k_symbol_household,trans_k_symbol_insurrance,trans_k_symbol_interest_credited,trans_k_symbol_loan,trans_k_symbol_old-age_pension,trans_k_symbol_payment_for_statement,trans_k_symbol_sanction_interest_neg_bal
0,2,1993-02-26,1998-12-31,2134 days,14,42000,3151514,6593.125523,478,1100,...,12.0,89.0,237.0,65.0,0.0,70.0,24.0,0.0,65.0,0.0
1,19,1995-04-07,1998-12-31,1364 days,1,22708,1575532,5199.775578,303,-10605,...,17.0,8.0,143.0,32.0,0.0,90.0,8.0,0.0,40.0,8.0
2,25,1996-07-28,1998-12-31,886 days,15,63300,2958556,10797.649635,274,900,...,54.0,93.0,99.0,27.0,27.0,28.0,12.0,0.0,26.0,0.0
3,37,1997-08-18,1998-12-31,500 days,0,49437,948159,7293.530769,130,-1011,...,19.0,43.0,51.0,14.0,14.0,17.0,1.0,0.0,13.0,1.0
4,38,1997-08-08,1998-12-31,510 days,30,20762,571952,4399.630769,130,13841,...,14.0,45.0,37.0,12.0,12.0,17.0,8.0,0.0,12.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
677,11327,1997-10-15,1998-12-31,442 days,15,30462,559884,7465.120000,75,300,...,16.0,12.0,33.0,9.0,0.0,14.0,3.0,0.0,9.0,0.0
678,11328,1996-11-05,1998-12-31,786 days,15,61000,1326829,9087.869863,146,1000,...,38.0,5.0,78.0,0.0,0.0,25.0,5.0,0.0,20.0,0.0
679,11349,1995-05-26,1998-12-31,1315 days,30,64800,3957378,13017.690789,304,200,...,5.0,77.0,136.0,39.0,0.0,43.0,38.0,0.0,38.0,0.0
680,11359,1994-10-01,1998-12-31,1552 days,15,40521,2948097,7799.198413,378,1000,...,2.0,104.0,148.0,46.0,0.0,51.0,12.0,0.0,46.0,0.0
681,11362,1995-10-14,1998-12-31,1174 days,15,24212,1330026,3866.354651,344,1000,...,43.0,160.0,103.0,34.0,34.0,38.0,24.0,0.0,33.0,0.0

In [93]:
df = pd.merge(df, trans_df_final_, how='left', on=['account_id'])
df

,loan_loan_id,account_id,loan_date,loan_amount,loan_duration,loan_payments,loan_status,acc_district_id,acc_frequency,acc_date,...,trans_operation_credit_in_cash,trans_operation_remittance_to_anotherbank,trans_operation_withdrawal_in_cash,trans_k_symbol_household,trans_k_symbol_insurrance,trans_k_symbol_interest_credited,trans_k_symbol_loan,trans_k_symbol_old-age_pension,trans_k_symbol_payment_for_statement,trans_k_symbol_sanction_interest_neg_bal
0,4959,2,1994-01-05,80952,24,3373.00,A,1,POPLATEK MESICNE,1993-02-26,...,12.0,89.0,237.0,65.0,0.0,70.0,24.0,0.0,65.0,0.0
1,4961,19,1996-04-29,30276,12,2523.00,B,21,POPLATEK MESICNE,1995-04-07,...,17.0,8.0,143.0,32.0,0.0,90.0,8.0,0.0,40.0,8.0
2,4962,25,1997-12-08,30276,12,2523.00,A,68,POPLATEK MESICNE,1996-07-28,...,54.0,93.0,99.0,27.0,27.0,28.0,12.0,0.0,26.0,0.0
3,4967,37,1998-10-14,318480,60,5308.00,D,20,POPLATEK MESICNE,1997-08-18,...,19.0,43.0,51.0,14.0,14.0,17.0,1.0,0.0,13.0,1.0
4,4968,38,1998-04-19,110736,48,2307.00,C,19,POPLATEK TYDNE,1997-08-08,...,14.0,45.0,37.0,12.0,12.0,17.0,8.0,0.0,12.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
677,7294,11327,1998-09-27,39168,24,1632.00,C,7,POPLATEK MESICNE,1997-10-15,...,16.0,12.0,33.0,9.0,0.0,14.0,3.0,0.0,9.0,0.0
678,7295,11328,1998-07-18,280440,60,4674.00,C,54,POPLATEK MESICNE,1996-11-05,...,38.0,5.0,78.0,0.0,0.0,25.0,5.0,0.0,20.0,0.0
679,7304,11349,1995-10-29,419880,60,6998.00,C,1,POPLATEK TYDNE,1995-05-26,...,5.0,77.0,136.0,39.0,0.0,43.0,38.0,0.0,38.0,0.0
680,7305,11359,1996-08-06,54024,12,4502.00,A,61,POPLATEK MESICNE,1994-10-01,...,2.0,104.0,148.0,46.0,0.0,51.0,12.0,0.0,46.0,0.0
681,7308,11362,1996-12-27,129408,24,5392.00,A,67,POPLATEK MESICNE,1995-10-14,...,43.0,160.0,103.0,34.0,34.0,38.0,24.0,0.0,33.0,0.0

# Disp & Client & Card

In [101]:
summary_df(disp_df)
summary_df(client_df)
summary_df(card_df)

(5369, 4)

   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT

missing value

disp_id       0
client_id     0
account_id    0
type          0
dtype: int64

(5369, 4)

   client_id gender  birth_date  district_id
0          1      F  1970-12-13           18
1          2      M  1945-02-04            1
2          3      F  1940-10-09            1
3          4      M  1956-12-01            5
4          5      F  1960-07-03            5

missing value

client_id      0
gender         0
birth_date     0
district_id    0
dtype: int64

(892, 4)

   card_id  disp_id     type      issued
0        1        9     gold  1998-10-16
1        2       19  classic  1998-03-13
2        3       41     gold  1995-09-03
3        4       42  classic  1998-11-26
4        5       51   junior  1995-04-24

missing value

card_id    0
disp_id    0
type       0
issued     0
dtype: int64

In [108]:
disp_df

      disp_id  client_id  account_id       type
0           1          1           1      OWNER
1           2          2           2      OWNER
2           3          3           2  DISPONENT
3           4          4           3      OWNER
4           5          5           3  DISPONENT
...       ...        ...         ...        ...
5364    13647      13955       11349      OWNER
5365    13648      13956       11349  DISPONENT
5366    13660      13968       11359      OWNER
5367    13663      13971       11362      OWNER
5368    13690      13998       11382      OWNER

[5369 rows x 4 columns]

In [122]:
dcc_df = pd.merge(disp_df, client_df, how='left', on='client_id')
dcc_df = pd.merge(dcc_df, card_df, how='left', on='disp_id')

dcc_df = dcc_df.rename(columns={'type_x': 'client_type', 'type_y':'card_type', 'issued':'card_issued'})
dcc_df.head()

,disp_id,client_id,account_id,client_type,gender,birth_date,district_id,card_id,card_type,card_issued
0,1,1,1,OWNER,F,1970-12-13,18,NaN,NaN,NaN
1,2,2,2,OWNER,M,1945-02-04,1,NaN,NaN,NaN
2,3,3,2,DISPONENT,F,1940-10-09,1,NaN,NaN,NaN
3,4,4,3,OWNER,M,1956-12-01,5,NaN,NaN,NaN
4,5,5,3,DISPONENT,F,1960-07-03,5,NaN,NaN,NaN

birth_date -> age

In [132]:
dcc_df['birth_date'] = pd.to_datetime(dcc_df['birth_date'], format='%Y-%m-%d')
dcc_df['now'] = pd.to_datetime("2000-01-01", format='%Y-%m-%d')
dcc_df['age'] = dcc_df['now'] - dcc_df['birth_date']
dcc_df

,disp_id,client_id,account_id,client_type,gender,birth_date,district_id,card_id,card_type,card_issued,now,age
0,1,1,1,OWNER,F,1970-12-13,18,NaN,NaN,NaN,2000-01-01,10611 days
1,2,2,2,OWNER,M,1945-02-04,1,NaN,NaN,NaN,2000-01-01,20054 days
2,3,3,2,DISPONENT,F,1940-10-09,1,NaN,NaN,NaN,2000-01-01,21633 days
3,4,4,3,OWNER,M,1956-12-01,5,NaN,NaN,NaN,2000-01-01,15736 days
4,5,5,3,DISPONENT,F,1960-07-03,5,NaN,NaN,NaN,2000-01-01,14426 days
...,...,...,...,...,...,...,...,...,...,...,...,...
5364,13647,13955,11349,OWNER,F,1945-10-30,1,NaN,NaN,NaN,2000-01-01,19786 days
5365,13648,13956,11349,DISPONENT,M,1943-04-06,1,NaN,NaN,NaN,2000-01-01,20724 days
5366,13660,13968,11359,OWNER,M,1968-04-13,61,1247.0,classic,1995-06-13,2000-01-01,11585 days
5367,13663,13971,11362,OWNER,F,1962-10-19,67,NaN,NaN,NaN,2000-01-01,13588 days
5368,13690,13998,11382,OWNER,F,1953-08-12,74,NaN,NaN,NaN,2000-01-01,16943 days

In [123]:
dcc_df['client_type'].value_counts()

OWNER        4500
DISPONENT     869
Name: client_type, dtype: int64

In [124]:
dcc_df['gender'].value_counts()

M    2724
F    2645
Name: gender, dtype: int64